Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/component/sqi.h
#define SQI_CFG_MODE_Pos                      _UINT32_(0)                                          /* (SQI_CFG) Mode Select The default value of this field is 0. After power on reset, the controller enters boot mode. 000 - Boot mode. The CSR registers are loaded with boot strap values. 001 - PIO mode. The controller is controlled by the CPU in PIO mode. 010 - DMA mode.  011 - XIP mode. When this mode is entered the controller behaves as if executing in Place (XIP) but uses the register data to control timing. 100 - 111 - Reserved Position */
#define SQI_CFG_MODE_Msk                      (_UINT32_(0x7) << SQI_CFG_MODE_Pos)                  /* (SQI_CFG) Mode Select The default value of this field is 0. After power on reset, the controller enters boot mode. 000 - Boot mode. The CSR registers are loaded with boot strap values. 001 - PIO mode. The controller is controlled by the CPU in PIO mode. 010 - DMA mode.  011 - XIP mode. When this mode is entered the controller behaves as if executing in Place (XIP) but uses the register data to control timing. 100 - 111 - Reserved Mask */
#define SQI_CFG_MODE(value)                   (SQI_CFG_MODE_Msk & (_UINT32_(value) << SQI_CFG_MODE_Pos)) /* Assigment of value for MODE in the SQI_CFG register */
#define SQI_CFG_CPHA_Pos                      _UINT32_(3)                                          /* (SQI_CFG) Clock phase (selects the transfer format) 0 = SPICLK starts toggling at the middle of 1st data bit. 1 = SPICLK starts toggling at the start of 1st data bit. Position */
#define SQI_CFG_CPHA_Msk                      (_UINT32_(0x1) << SQI_CFG_CPHA_Pos)                  /* (SQI_CFG) Clock phase (selects the transfer format) 0 = SPICLK starts toggling at the middle of 1st data bit. 1 = SPICLK starts toggling at the start of 1st data bit. Mask */
#define SQI_CFG_CPHA(value)                   (SQI_CFG_CPHA_Msk & (_UINT32_(value) << SQI_CFG_CPHA_Pos)) /* Assigment of value for CPHA in the SQI_CFG register */
#define SQI_CFG_CPOL_Pos                      _UINT32_(4)                                          /* (SQI_CFG) Clock polarity 0 = active-high SPICLK (SPICLK low is the idle state) 1 = active-low SPICLK (SPICLK high is the idle state) Position */
#define SQI_CFG_CPOL_Msk                      (_UINT32_(0x1) << SQI_CFG_CPOL_Pos)                  /* (SQI_CFG) Clock polarity 0 = active-high SPICLK (SPICLK low is the idle state) 1 = active-low SPICLK (SPICLK high is the idle state) Mask */
#define SQI_CFG_CPOL(value)                   (SQI_CFG_CPOL_Msk & (_UINT32_(value) << SQI_CFG_CPOL_Pos)) /* Assigment of value for CPOL in the SQI_CFG register */
#define SQI_CFG_LSBF_Pos                      _UINT32_(5)                                          /* (SQI_CFG) Data format on SPI interface  0 = MSBit sent/received first. 1 = LSBit sent/received first.  This setting is supeceded by LSBF control bit in Buffer Descriptor during DMA operations. Position */
#define SQI_CFG_LSBF_Msk                      (_UINT32_(0x1) << SQI_CFG_LSBF_Pos)                  /* (SQI_CFG) Data format on SPI interface  0 = MSBit sent/received first. 1 = LSBit sent/received first.  This setting is supeceded by LSBF control bit in Buffer Descriptor during DMA operations. Mask */
#define SQI_CFG_LSBF(value)                   (SQI_CFG_LSBF_Msk & (_UINT32_(value) << SQI_CFG_LSBF_Pos)) /* Assigment of value for LSBF in the SQI_CFG register */
#define SQI_CFG_WP_Pos                        _UINT32_(9)                                          /* (SQI_CFG) Write Protect: In single or Dual lane mode, this bit is used to drive the spiout2 signal. Whenever this bit is high, the controller drives 0 on spiout2 line and sets spimoe2 high (active only during transfer). Position */
#define SQI_CFG_WP_Msk                        (_UINT32_(0x1) << SQI_CFG_WP_Pos)                    /* (SQI_CFG) Write Protect: In single or Dual lane mode, this bit is used to drive the spiout2 signal. Whenever this bit is high, the controller drives 0 on spiout2 line and sets spimoe2 high (active only during transfer). Mask */
#define SQI_CFG_WP(value)                     (SQI_CFG_WP_Msk & (_UINT32_(value) << SQI_CFG_WP_Pos)) /* Assigment of value for WP in the SQI_CFG register */
#define SQI_CFG_HOLD_Pos                      _UINT32_(10)                                         /* (SQI_CFG) Hold: In Single or Dual lane mode, this bit is used to drive the spiout3 signal. Whenever this bit is high, the controller drives 0 on spiout3 line and sets spimoe3 high (active only during transfer). Position */
#define SQI_CFG_HOLD_Msk                      (_UINT32_(0x1) << SQI_CFG_HOLD_Pos)                  /* (SQI_CFG) Hold: In Single or Dual lane mode, this bit is used to drive the spiout3 signal. Whenever this bit is high, the controller drives 0 on spiout3 line and sets spimoe3 high (active only during transfer). Mask */
#define SQI_CFG_HOLD(value)                   (SQI_CFG_HOLD_Msk & (_UINT32_(value) << SQI_CFG_HOLD_Pos)) /* Assigment of value for HOLD in the SQI_CFG register */
#define SQI_CFG_BURSTEN_Pos                   _UINT32_(11)                                         /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR is enabled 0 - AHB INCR is disabled Position */
#define SQI_CFG_BURSTEN_Msk                   (_UINT32_(0x1) << SQI_CFG_BURSTEN_Pos)               /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR is enabled 0 - AHB INCR is disabled Mask */
#define SQI_CFG_BURSTEN(value)                (SQI_CFG_BURSTEN_Msk & (_UINT32_(value) << SQI_CFG_BURSTEN_Pos)) /* Assigment of value for BURSTEN in the SQI_CFG register */
#define SQI_CFG_AHB_BURST_INCR4_EN_Pos        _UINT32_(12)                                         /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR4 is enabled. 0 - AHB INCR4 is disabled Position */
#define SQI_CFG_AHB_BURST_INCR4_EN_Msk        (_UINT32_(0x1) << SQI_CFG_AHB_BURST_INCR4_EN_Pos)    /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR4 is enabled. 0 - AHB INCR4 is disabled Mask */
#define SQI_CFG_AHB_BURST_INCR4_EN(value)     (SQI_CFG_AHB_BURST_INCR4_EN_Msk & (_UINT32_(value) << SQI_CFG_AHB_BURST_INCR4_EN_Pos)) /* Assigment of value for AHB_BURST_INCR4_EN in the SQI_CFG register */
#define SQI_CFG_AHB_BURST_INCR8_EN_Pos        _UINT32_(13)                                         /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR8 is enabled. 0 - AHB INCR8 is disabled Position */
#define SQI_CFG_AHB_BURST_INCR8_EN_Msk        (_UINT32_(0x1) << SQI_CFG_AHB_BURST_INCR8_EN_Pos)    /* (SQI_CFG) This field is used to configure the AHB Master Burst capability. 1 - AHB INCR8 is enabled. 0 - AHB INCR8 is disabled Mask */
#define SQI_CFG_AHB_BURST_INCR8_EN(value)     (SQI_CFG_AHB_BURST_INCR8_EN_Msk & (_UINT32_(value) << SQI_CFG_AHB_BURST_INCR8_EN_Pos)) /* Assigment of value for AHB_BURST_INCR8_EN in the SQI_CFG register */
#define SQI_CFG_AHB_BURST_INCR16_EN_Pos       _UINT32_(14)                                         /* (SQI_CFG) This field is used to configure the AHB Master Burst capability.  1 - AHB INCR16 is enabled.  0 - AHB INCR16 is disabled Position */
#define SQI_CFG_AHB_BURST_INCR16_EN_Msk       (_UINT32_(0x1) << SQI_CFG_AHB_BURST_INCR16_EN_Pos)   /* (SQI_CFG) This field is used to configure the AHB Master Burst capability.  1 - AHB INCR16 is enabled.  0 - AHB INCR16 is disabled Mask */
#define SQI_CFG_AHB_BURST_INCR16_EN(value)    (SQI_CFG_AHB_BURST_INCR16_EN_Msk & (_UINT32_(value) << SQI_CFG_AHB_BURST_INCR16_EN_Pos)) /* Assigment of value for AHB_BURST_INCR16_EN in the SQI_CFG register */
#define SQI_CFG_TXBUFRST_Pos                  _UINT32_(17)                                         /* (SQI_CFG) Transmit FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Transmit FIFO pointers will get reset by this reset pulse. Note: Transmit FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during  transaction, we need to go for soft reset only.Note: For Michigan Ax versions, treat as Reserved, keep 0. Position */
#define SQI_CFG_TXBUFRST_Msk                  (_UINT32_(0x1) << SQI_CFG_TXBUFRST_Pos)              /* (SQI_CFG) Transmit FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Transmit FIFO pointers will get reset by this reset pulse. Note: Transmit FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during  transaction, we need to go for soft reset only.Note: For Michigan Ax versions, treat as Reserved, keep 0. Mask */
#define SQI_CFG_TXBUFRST(value)               (SQI_CFG_TXBUFRST_Msk & (_UINT32_(value) << SQI_CFG_TXBUFRST_Pos)) /* Assigment of value for TXBUFRST in the SQI_CFG register */
#define SQI_CFG_RXBUFRST_Pos                  _UINT32_(18)                                         /* (SQI_CFG) Receive FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Receive fifo pointers will get reset by this reset pulse. Note: Receive FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0. Position */
#define SQI_CFG_RXBUFRST_Msk                  (_UINT32_(0x1) << SQI_CFG_RXBUFRST_Pos)              /* (SQI_CFG) Receive FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Receive fifo pointers will get reset by this reset pulse. Note: Receive FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0. Mask */
#define SQI_CFG_RXBUFRST(value)               (SQI_CFG_RXBUFRST_Msk & (_UINT32_(value) << SQI_CFG_RXBUFRST_Pos)) /* Assigment of value for RXBUFRST in the SQI_CFG register */
#define SQI_CFG_CONBUFRST_Pos                 _UINT32_(19)                                         /* (SQI_CFG) Control FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Control fifo pointers will get reset by this reset pulse. Note: Control FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0. Position */
#define SQI_CFG_CONBUFRST_Msk                 (_UINT32_(0x1) << SQI_CFG_CONBUFRST_Pos)             /* (SQI_CFG) Control FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Control fifo pointers will get reset by this reset pulse. Note: Control FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0. Mask */
#define SQI_CFG_CONBUFRST(value)              (SQI_CFG_CONBUFRST_Msk & (_UINT32_(value) << SQI_CFG_CONBUFRST_Pos)) /* Assigment of value for CONBUFRST in the SQI_CFG register */
#define SQI_CFG_DATAEN_Pos                    _UINT32_(20)                                         /* (SQI_CFG) Max Data Lanes 11 - Reserved, 10 - 4, 01 - 2, 00 - 1 SPI_OUT_PIN_EN[3:0] output pins are controlled by writing to these bits. Position */
#define SQI_CFG_DATAEN_Msk                    (_UINT32_(0x3) << SQI_CFG_DATAEN_Pos)                /* (SQI_CFG) Max Data Lanes 11 - Reserved, 10 - 4, 01 - 2, 00 - 1 SPI_OUT_PIN_EN[3:0] output pins are controlled by writing to these bits. Mask */
#define SQI_CFG_DATAEN(value)                 (SQI_CFG_DATAEN_Msk & (_UINT32_(value) << SQI_CFG_DATAEN_Pos)) /* Assigment of value for DATAEN in the SQI_CFG register */
#define SQI_CFG_SQIEN_Pos                     _UINT32_(23)                                         /* (SQI_CFG) 1 - Enabled, 0 - Disabled SPI_ON output pin is controlled by writing to  this bit. Position */
#define SQI_CFG_SQIEN_Msk                     (_UINT32_(0x1) << SQI_CFG_SQIEN_Pos)                 /* (SQI_CFG) 1 - Enabled, 0 - Disabled SPI_ON output pin is controlled by writing to  this bit. Mask */
#define SQI_CFG_SQIEN(value)                  (SQI_CFG_SQIEN_Msk & (_UINT32_(value) << SQI_CFG_SQIEN_Pos)) /* Assigment of value for SQIEN in the SQI_CFG register */
#define SQI_CFG_CSEN_Pos                      _UINT32_(24)                                         /* (SQI_CFG) 1 - Chip Select is used 0 - Chip Select is not used SPI_CS[7] for  CS7, SPI_CS[6] for  CS6, SPI_CS[5] for  CS5, SPI_CS[4] for  CS4, SPI_CS[3] for  CS3, SPI_CS[2] for  CS2, SPI_CS[1] for  CS1, SPI_CS[0] for  CS0. SPI_CS_PIN_EN[7:0/3:0] output pins are  controlled by writing to these bits. Position */
#define SQI_CFG_CSEN_Msk                      (_UINT32_(0xFF) << SQI_CFG_CSEN_Pos)                 /* (SQI_CFG) 1 - Chip Select is used 0 - Chip Select is not used SPI_CS[7] for  CS7, SPI_CS[6] for  CS6, SPI_CS[5] for  CS5, SPI_CS[4] for  CS4, SPI_CS[3] for  CS3, SPI_CS[2] for  CS2, SPI_CS[1] for  CS1, SPI_CS[0] for  CS0. SPI_CS_PIN_EN[7:0/3:0] output pins are  controlled by writing to these bits. Mask */
#define SQI_CFG_CSEN(value)                   (SQI_CFG_CSEN_Msk & (_UINT32_(value) << SQI_CFG_CSEN_Pos)) /* Assigment of value for CSEN in the SQI_CFG register */
#define SQI_CFG_Msk                           _UINT32_(0xFFBE7E3F)                                 /* (SQI_CFG) Register Mask  */


/* -------- SQI_CON : (SQI Offset: 0x10C) (R/W 32) SPI Control register -------- */
#define SQI_CON_RESETVALUE                    _UINT32_(0x00)                                       /*  (SQI_CON) SPI Control register  Reset Value */

#define SQI_CON_TXRXCOUNT_Pos                 _UINT32_(0)                                          /* (SQI_CON) This bit specifies the total number of bytes to transmit or receive (based on CMD_INIT field). ,16?d 0 - Reserved,16?d 1 - 1byte to transmit/receive ,16?d 2 - 2bytes to transmit/receive NOTE: Count must be programmed to non-zero value prior to initiating transaction Position */
#define SQI_CON_TXRXCOUNT_Msk                 (_UINT32_(0xFFFF) << SQI_CON_TXRXCOUNT_Pos)          /* (SQI_CON) This bit specifies the total number of bytes to transmit or receive (based on CMD_INIT field). ,16?d 0 - Reserved,16?d 1 - 1byte to transmit/receive ,16?d 2 - 2bytes to transmit/receive NOTE: Count must be programmed to non-zero value prior to initiating transaction Mask */
#define SQI_CON_TXRXCOUNT(value)              (SQI_CON_TXRXCOUNT_Msk & (_UINT32_(value) << SQI_CON_TXRXCOUNT_Pos)) /* Assigment of value for TXRXCOUNT in the SQI_CON register */
#define SQI_CON_CMDINIT_Pos                   _UINT32_(16)                                         /* (SQI_CON) This signal indicates the command initiation mode. If it is Transmit, Commands are initiated based on writes to transmit register or the contents of TX FIFO. If the CMD_INIT is Receive, commands are initiated based on reads to Read register or RX FIFO availability. 00 = Reserved.  01 = Initiate Transmit.  10 = Initiate Receive. 11 = Reserved.  Note: If Boot mode is enabled, the default value  is 2?b10  This is NOT active status field, see SPI Status2 Reg (0x30) Position */
#define SQI_CON_CMDINIT_Msk                   (_UINT32_(0x3) << SQI_CON_CMDINIT_Pos)               /* (SQI_CON) This signal indicates the command initiation mode. If it is Transmit, Commands are initiated based on writes to transmit register or the contents of TX FIFO. If the CMD_INIT is Receive, commands are initiated based on reads to Read register or RX FIFO availability. 00 = Reserved.  01 = Initiate Transmit.  10 = Initiate Receive. 11 = Reserved.  Note: If Boot mode is enabled, the default value  is 2?b10  This is NOT active status field, see SPI Status2 Reg (0x30) Mask */
#define SQI_CON_CMDINIT(value)                (SQI_CON_CMDINIT_Msk & (_UINT32_(value) << SQI_CON_CMDINIT_Pos)) /* Assigment of value for CMDINIT in the SQI_CON register */
#define SQI_CON_LANEMODE_Pos                  _UINT32_(18)                                         /* (SQI_CON) SPI Lane mode 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use Position */
#define SQI_CON_LANEMODE_Msk                  (_UINT32_(0x3) << SQI_CON_LANEMODE_Pos)              /* (SQI_CON) SPI Lane mode 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use Mask */
#define SQI_CON_LANEMODE(value)               (SQI_CON_LANEMODE_Msk & (_UINT32_(value) << SQI_CON_LANEMODE_Pos)) /* Assigment of value for LANEMODE in the SQI_CON register */
#define SQI_CON_DEVSEL_Pos                    _UINT32_(20)                                         /* (SQI_CON) SPI Device Select: This field along with bit25 is used to select a particular SPI device. Note: For Michigan Ax versions, extension by bit25 is NOT used (only 4 devices are selectable, by bits 21:20 here). Position */
#define SQI_CON_DEVSEL_Msk                    (_UINT32_(0x3) << SQI_CON_DEVSEL_Pos)                /* (SQI_CON) SPI Device Select: This field along with bit25 is used to select a particular SPI device. Note: For Michigan Ax versions, extension by bit25 is NOT used (only 4 devices are selectable, by bits 21:20 here). Mask */
#define SQI_CON_DEVSEL(value)                 (SQI_CON_DEVSEL_Msk & (_UINT32_(value) << SQI_CON_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the SQI_CON register */
#define SQI_CON_DASSERT_Pos                   _UINT32_(22)                                         /* (SQI_CON) Chip Select Assert 0 - CS is not de-asserted after transmission/reception of specified number of bytes in the control register 1 - CS is de-asserted after transmission/reception of specified number of bytes in the control register Position */
#define SQI_CON_DASSERT_Msk                   (_UINT32_(0x1) << SQI_CON_DASSERT_Pos)               /* (SQI_CON) Chip Select Assert 0 - CS is not de-asserted after transmission/reception of specified number of bytes in the control register 1 - CS is de-asserted after transmission/reception of specified number of bytes in the control register Mask */
#define SQI_CON_DASSERT(value)                (SQI_CON_DASSERT_Msk & (_UINT32_(value) << SQI_CON_DASSERT_Pos)) /* Assigment of value for DASSERT in the SQI_CON register */
#define SQI_CON_DDRMODE_Pos                   _UINT32_(23)                                         /* (SQI_CON) SDR_DDR: 0 - SDR mode, 1 - DDR mode. Note: For Michigan Ax versions this bit is Reserved and should be kept 0. Position */
#define SQI_CON_DDRMODE_Msk                   (_UINT32_(0x1) << SQI_CON_DDRMODE_Pos)               /* (SQI_CON) SDR_DDR: 0 - SDR mode, 1 - DDR mode. Note: For Michigan Ax versions this bit is Reserved and should be kept 0. Mask */
#define SQI_CON_DDRMODE(value)                (SQI_CON_DDRMODE_Msk & (_UINT32_(value) << SQI_CON_DDRMODE_Pos)) /* Assigment of value for DDRMODE in the SQI_CON register */
#define SQI_CON_SCHECK_Pos                    _UINT32_(24)                                         /* (SQI_CON) Status Check This bit is mainly used for Programming or Erase operations. 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: For Michigan Ax versions, this bit is Reserved and should be kept 0. Position */
#define SQI_CON_SCHECK_Msk                    (_UINT32_(0x1) << SQI_CON_SCHECK_Pos)                /* (SQI_CON) Status Check This bit is mainly used for Programming or Erase operations. 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: For Michigan Ax versions, this bit is Reserved and should be kept 0. Mask */
#define SQI_CON_SCHECK(value)                 (SQI_CON_SCHECK_Msk & (_UINT32_(value) << SQI_CON_SCHECK_Pos)) /* Assigment of value for SCHECK in the SQI_CON register */
#define SQI_CON_DEV_SEL_2_Pos                 _UINT32_(25)                                         /* (SQI_CON) SPI Device Select[2]: This field along with SPI DEVICE SELECT [1:0] (bits 21:20) together is used to select a particular SPI device. Bit25 Bit21 Bit20  0 0 0 - SPI Device 0 ,0 0 1 - SPI Device 1 ,0 1 0 - SPI Device 2  ,0 1 1 - SPI Device 3, 1 0 0 - SPI Device 4 ,1 0 1 - SPI Device 5 ,1 1 0 - SPI Device 6 ,1 1 1 - SPI Device 7 Note: For Michigan Ax versions, this bit is Reserved and should be kept 0. Position */
#define SQI_CON_DEV_SEL_2_Msk                 (_UINT32_(0x1) << SQI_CON_DEV_SEL_2_Pos)             /* (SQI_CON) SPI Device Select[2]: This field along with SPI DEVICE SELECT [1:0] (bits 21:20) together is used to select a particular SPI device. Bit25 Bit21 Bit20  0 0 0 - SPI Device 0 ,0 0 1 - SPI Device 1 ,0 1 0 - SPI Device 2  ,0 1 1 - SPI Device 3, 1 0 0 - SPI Device 4 ,1 0 1 - SPI Device 5 ,1 1 0 - SPI Device 6 ,1 1 1 - SPI Device 7 Note: For Michigan Ax versions, this bit is Reserved and should be kept 0. Mask */
#define SQI_CON_DEV_SEL_2(value)              (SQI_CON_DEV_SEL_2_Msk & (_UINT32_(value) << SQI_CON_DEV_SEL_2_Pos)) /* Assigment of value for DEV_SEL_2 in the SQI_CON register */
#define SQI_CON_Msk                           _UINT32_(0x03FFFFFF)                                 /* (SQI_CON) Register Mask  */

#define SQI_CON_DEV_SEL__Pos                  _UINT32_(25)                                         /* (SQI_CON Position) SPI Device Select[2]: This field along with SPI DEVICE SELECT [x:x] (bits 2x:2x) together is used to select a particular SPI device. Bit25 Bit2x Bit2x  x x x - SPI Device x ,x x x - SPI Device x ,x x x - SPI Device 2  ,x x x - SPI Device 3, x x x - SPI Device 4 ,x x x - SPI Device 5 ,x x x - SPI Device 6 ,x x x - SPI Device 7 Note: For Michigan Ax versions, this bit is Reserved and should be kept x. */
#define SQI_CON_DEV_SEL__Msk                  (_UINT32_(0x1) << SQI_CON_DEV_SEL__Pos)              /* (SQI_CON Mask) DEV_SEL_ */
#define SQI_CON_DEV_SEL_(value)               (SQI_CON_DEV_SEL__Msk & (_UINT32_(value) << SQI_CON_DEV_SEL__Pos)) 

