Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/component/sqi.h
#define SQI_XCON3_INIT1CMD1_Pos               _UINT32_(0)                                          /* (SQI_XCON3) 8bit SPI Init1 Code1 value. Position */
#define SQI_XCON3_INIT1CMD1_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD1_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code1 value. Mask */
#define SQI_XCON3_INIT1CMD1(value)            (SQI_XCON3_INIT1CMD1_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD1_Pos)) /* Assigment of value for INIT1CMD1 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1CMD2_Pos               _UINT32_(8)                                          /* (SQI_XCON3) 8bit SPI Init1 Code2 value. Position */
#define SQI_XCON3_INIT1CMD2_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD2_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code2 value. Mask */
#define SQI_XCON3_INIT1CMD2(value)            (SQI_XCON3_INIT1CMD2_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD2_Pos)) /* Assigment of value for INIT1CMD2 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1CMD3_Pos               _UINT32_(16)                                         /* (SQI_XCON3) 8bit SPI Init1 Code3 value. Position */
#define SQI_XCON3_INIT1CMD3_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD3_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code3 value. Mask */
#define SQI_XCON3_INIT1CMD3(value)            (SQI_XCON3_INIT1CMD3_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD3_Pos)) /* Assigment of value for INIT1CMD3 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1TYPE_Pos               _UINT32_(24)                                         /* (SQI_XCON3) SPI TYPE  INIT1: 00 - Single lane mode , 01 - Dual lane mode , 10 - Quad lane mode , 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT1 Code in 1/2/4 lane. Position */
#define SQI_XCON3_INIT1TYPE_Msk               (_UINT32_(0x3) << SQI_XCON3_INIT1TYPE_Pos)           /* (SQI_XCON3) SPI TYPE  INIT1: 00 - Single lane mode , 01 - Dual lane mode , 10 - Quad lane mode , 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT1 Code in 1/2/4 lane. Mask */
#define SQI_XCON3_INIT1TYPE(value)            (SQI_XCON3_INIT1TYPE_Msk & (_UINT32_(value) << SQI_XCON3_INIT1TYPE_Pos)) /* Assigment of value for INIT1TYPE in the SQI_XCON3 register */
#define SQI_XCON3_INIT1COUNT_Pos              _UINT32_(26)                                         /* (SQI_XCON3) 2bit SPI INIT1 Count. Indicates whether 1, 2 or 3 bytes of INIT1 Code value are being sent. Position */
#define SQI_XCON3_INIT1COUNT_Msk              (_UINT32_(0x3) << SQI_XCON3_INIT1COUNT_Pos)          /* (SQI_XCON3) 2bit SPI INIT1 Count. Indicates whether 1, 2 or 3 bytes of INIT1 Code value are being sent. Mask */
#define SQI_XCON3_INIT1COUNT(value)           (SQI_XCON3_INIT1COUNT_Msk & (_UINT32_(value) << SQI_XCON3_INIT1COUNT_Pos)) /* Assigment of value for INIT1COUNT in the SQI_XCON3 register */
#define SQI_XCON3_INIT1SCHECK_Pos             _UINT32_(28)                                         /* (SQI_XCON3) SPI Init1 Status Check: 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status Control Reg (@0x60) Position */
#define SQI_XCON3_INIT1SCHECK_Msk             (_UINT32_(0x1) << SQI_XCON3_INIT1SCHECK_Pos)         /* (SQI_XCON3) SPI Init1 Status Check: 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status Control Reg (@0x60) Mask */
#define SQI_XCON3_INIT1SCHECK(value)          (SQI_XCON3_INIT1SCHECK_Msk & (_UINT32_(value) << SQI_XCON3_INIT1SCHECK_Pos)) /* Assigment of value for INIT1SCHECK in the SQI_XCON3 register */
#define SQI_XCON3_Msk                         _UINT32_(0x1FFFFFFF)                                 /* (SQI_XCON3) Register Mask  */


/* -------- SQI_XCON4 : (SQI Offset: 0x168) (R/W 32) SPI XIP Control4 Register -------- */
#define SQI_XCON4_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_XCON4) SPI XIP Control4 Register  Reset Value */

#define SQI_XCON4_INIT2CMD1_Pos               _UINT32_(0)                                          /* (SQI_XCON4) 8bit SPI Init2 Code1 value. Position */
#define SQI_XCON4_INIT2CMD1_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD1_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code1 value. Mask */
#define SQI_XCON4_INIT2CMD1(value)            (SQI_XCON4_INIT2CMD1_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD1_Pos)) /* Assigment of value for INIT2CMD1 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2CMD2_Pos               _UINT32_(8)                                          /* (SQI_XCON4) 8bit SPI Init2 Code2 value Position */
#define SQI_XCON4_INIT2CMD2_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD2_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code2 value Mask */
#define SQI_XCON4_INIT2CMD2(value)            (SQI_XCON4_INIT2CMD2_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD2_Pos)) /* Assigment of value for INIT2CMD2 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2CMD3_Pos               _UINT32_(16)                                         /* (SQI_XCON4) 8bit SPI Init2 Code3 value Position */
#define SQI_XCON4_INIT2CMD3_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD3_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code3 value Mask */
#define SQI_XCON4_INIT2CMD3(value)            (SQI_XCON4_INIT2CMD3_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD3_Pos)) /* Assigment of value for INIT2CMD3 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2TYPE_Pos               _UINT32_(24)                                         /* (SQI_XCON4) SPI TYPE INIT2:  00 - Single lane mode. 01 - Dual lane mode. 10 - Quad lane mode. 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT2 Code in 1/2/4 lane. Position */
#define SQI_XCON4_INIT2TYPE_Msk               (_UINT32_(0x3) << SQI_XCON4_INIT2TYPE_Pos)           /* (SQI_XCON4) SPI TYPE INIT2:  00 - Single lane mode. 01 - Dual lane mode. 10 - Quad lane mode. 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT2 Code in 1/2/4 lane. Mask */
#define SQI_XCON4_INIT2TYPE(value)            (SQI_XCON4_INIT2TYPE_Msk & (_UINT32_(value) << SQI_XCON4_INIT2TYPE_Pos)) /* Assigment of value for INIT2TYPE in the SQI_XCON4 register */
#define SQI_XCON4_INIT2COUNT_Pos              _UINT32_(26)                                         /* (SQI_XCON4) 2bit SPI INIT2 Count. Indicates whether 1, 2 or 3 bytes of INIT2 Code value are being sent. Position */
#define SQI_XCON4_INIT2COUNT_Msk              (_UINT32_(0x3) << SQI_XCON4_INIT2COUNT_Pos)          /* (SQI_XCON4) 2bit SPI INIT2 Count. Indicates whether 1, 2 or 3 bytes of INIT2 Code value are being sent. Mask */
#define SQI_XCON4_INIT2COUNT(value)           (SQI_XCON4_INIT2COUNT_Msk & (_UINT32_(value) << SQI_XCON4_INIT2COUNT_Pos)) /* Assigment of value for INIT2COUNT in the SQI_XCON4 register */
#define SQI_XCON4_INIT2SCHECK_Pos             _UINT32_(28)                                         /* (SQI_XCON4) SPI Init2 Status Check: 0 - do not check status 1 - check status If this bit is set to 1, the hardware will issue the status command automatically after thecurrent operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status  Control Reg (@0x60) Position */
#define SQI_XCON4_INIT2SCHECK_Msk             (_UINT32_(0x1) << SQI_XCON4_INIT2SCHECK_Pos)         /* (SQI_XCON4) SPI Init2 Status Check: 0 - do not check status 1 - check status If this bit is set to 1, the hardware will issue the status command automatically after thecurrent operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status  Control Reg (@0x60) Mask */
#define SQI_XCON4_INIT2SCHECK(value)          (SQI_XCON4_INIT2SCHECK_Msk & (_UINT32_(value) << SQI_XCON4_INIT2SCHECK_Pos)) /* Assigment of value for INIT2SCHECK in the SQI_XCON4 register */
#define SQI_XCON4_Msk                         _UINT32_(0x1FFFFFFF)                                 /* (SQI_XCON4) Register Mask  */


/** \brief SQI register offsets definitions */
#define SQI_BDCTRL_REG_OFST            _UINT32_(0x00)      /* (SQI_BDCTRL) Buffer Descriptor Control Register Offset */
#define SQI_BDSTATUS_REG_OFST          _UINT32_(0x04)      /* (SQI_BDSTATUS) Buffer Descriptor Status Register Offset */
#define SQI_BDADDR_REG_OFST            _UINT32_(0x08)      /* (SQI_BDADDR) Buffer Descriptor Address Register Offset */
#define SQI_BDNXTPTR_REG_OFST          _UINT32_(0x0C)      /* (SQI_BDNXTPTR) Buffer Descriptor Next Pointer Register Offset */
#define SQI_CTRLA_REG_OFST             _UINT32_(0x00)      /* (SQI_CTRLA) Control A register Offset */
#define SQI_INTENCLR_REG_OFST          _UINT32_(0x10)      /* (SQI_INTENCLR) Interrupt Enable Clear Register Offset */
#define SQI_INTENSET_REG_OFST          _UINT32_(0x14)      /* (SQI_INTENSET) Interrupt Enable Set Register Offset */
#define SQI_INTFLAG_REG_OFST           _UINT32_(0x18)      /* (SQI_INTFLAG) Interrupt Status and Clear Register Offset */
#define SQI_SYNCBUSY_REG_OFST          _UINT32_(0x20)      /* (SQI_SYNCBUSY) Syncbusy Register Offset */
#define SQI_XCON1_REG_OFST             _UINT32_(0x100)     /* (SQI_XCON1) SPI XIP Control1 register Offset */
#define SQI_XCON2_REG_OFST             _UINT32_(0x104)     /* (SQI_XCON2) SPI XIP Control2 register Offset */
#define SQI_CFG_REG_OFST               _UINT32_(0x108)     /* (SQI_CFG) SPI Configuration Register Offset */
#define SQI_CON_REG_OFST               _UINT32_(0x10C)     /* (SQI_CON) SPI Control register Offset */
#define SQI_CLKCON_REG_OFST            _UINT32_(0x110)     /* (SQI_CLKCON) SPI Clock Control register Offset */
#define SQI_CMDTHR_REG_OFST            _UINT32_(0x114)     /* (SQI_CMDTHR) SPI command threshold register Offset */
#define SQI_INTTHR_REG_OFST            _UINT32_(0x118)     /* (SQI_INTTHR) SPI Interrupt Threshold register Offset */
#define SQI_INTEN_REG_OFST             _UINT32_(0x11C)     /* (SQI_INTEN) SPI Interrupt Enable Register Offset */
#define SQI_INTSTAT_REG_OFST           _UINT32_(0x120)     /* (SQI_INTSTAT) SPI Interrupt Status Register Offset */
#define SQI_TXDATA_REG_OFST            _UINT32_(0x124)     /* (SQI_TXDATA) SPI Transmit Data Register Offset */
#define SQI_RXDATA_REG_OFST            _UINT32_(0x128)     /* (SQI_RXDATA) SPI Receive Data Register Offset */
#define SQI_STAT1_REG_OFST             _UINT32_(0x12C)     /* (SQI_STAT1) SPI Status1 Register Offset */
#define SQI_STAT2_REG_OFST             _UINT32_(0x130)     /* (SQI_STAT2) SPI status 2 register Offset */
#define SQI_BDCON_REG_OFST             _UINT32_(0x134)     /* (SQI_BDCON) BD_CTRL Register Offset */
#define SQI_BDCURADD_REG_OFST          _UINT32_(0x138)     /* (SQI_BDCURADD) BD_CURR_ADDR Register Offset */
#define SQI_BDBASEADD_REG_OFST         _UINT32_(0x140)     /* (SQI_BDBASEADD) BD_BASE_ADDR register Offset */
#define SQI_BDSTAT_REG_OFST            _UINT32_(0x144)     /* (SQI_BDSTAT) BD_STATUS Register Offset */
#define SQI_BDPOLLCON_REG_OFST         _UINT32_(0x148)     /* (SQI_BDPOLLCON) BD_POLL_CTRL Register Offset */
#define SQI_BDTXDSTAT_REG_OFST         _UINT32_(0x14C)     /* (SQI_BDTXDSTAT) BD_TX_DMA_STATUS Register Offset */
#define SQI_BDRXDSTAT_REG_OFST         _UINT32_(0x150)     /* (SQI_BDRXDSTAT) BD_RX_DMA_STATUS Register Offset */
#define SQI_THR_REG_OFST               _UINT32_(0x154)     /* (SQI_THR) SPI Control threshold register Offset */
#define SQI_INTSIGEN_REG_OFST          _UINT32_(0x158)     /* (SQI_INTSIGEN) SPI Interrupt Signal Enable Register Offset */
#define SQI_TAPCON_REG_OFST            _UINT32_(0x15C)     /* (SQI_TAPCON) Tap Control Register Offset */
#define SQI_MEMSTAT_REG_OFST           _UINT32_(0x160)     /* (SQI_MEMSTAT) SPI Status Control Register Offset */
#define SQI_XCON3_REG_OFST             _UINT32_(0x164)     /* (SQI_XCON3) SPI XIP Control 3 Register Offset */
#define SQI_XCON4_REG_OFST             _UINT32_(0x168)     /* (SQI_XCON4) SPI XIP Control4 Register Offset */

